
#### Terragrunt Plan `success`
<details><summary>Show Plan</summary>

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_app_service.gratibot_app_service must be replaced
-/+ resource "azurerm_app_service" "gratibot_app_service" {
      ~ app_service_plan_id               = "/subscriptions/761bf739-12c3-43cb-bec9-d87c1d7fa459/resourceGroups/gratibot-azure-data/providers/Microsoft.Web/serverfarms/gratibot-non-prod-service-plan" -> (known after apply)
      ~ app_settings                      = {
          ~ "BOT_USER_OAUTH_ACCESS_TOKEN" = "xoxb-3253683248-1943751487634-py1n5xLx9xvVp2U0F9uR2KyA" -> "xoxb-3253683248-570458445558-n7wpoqCsG3b6Q2gS5tg2H8r6"
          - "DOCKER_REGISTRY_SERVER_URL"  = "https://index.docker.io/v1" -> null
          ~ "SIGNING_SECRET"              = "da998d8f3d4b4e27799acbe589c09522" -> "93c5fb643324c5556acdaac50c10f67b"
            # (2 unchanged elements hidden)
        }
      ~ custom_domain_verification_id     = "924C59280E3A2CFEB94E5CA6EC3BF99D74B67A79BABA84C3C2352440466E4334" -> (known after apply)
      ~ default_site_hostname             = "gratibot-non-prod-service.azurewebsites.net" -> (known after apply)
      ~ id                                = "/subscriptions/761bf739-12c3-43cb-bec9-d87c1d7fa459/resourceGroups/gratibot-azure-data/providers/Microsoft.Web/sites/gratibot-non-prod-service" -> (known after apply)
      ~ name                              = "gratibot-non-prod-service" -> "gratibot-nonprod-service"
      ~ outbound_ip_address_list          = [
          - "52.154.244.221",
          - "52.154.244.240",
          - "52.154.245.2",
          - "52.154.245.48",
          - "52.154.245.103",
          - "52.154.245.121",
          - "20.40.202.3",
        ] -> (known after apply)
      ~ outbound_ip_addresses             = "52.154.244.221,52.154.244.240,52.154.245.2,52.154.245.48,52.154.245.103,52.154.245.121,20.40.202.3" -> (known after apply)
      ~ possible_outbound_ip_address_list = [
          - "52.154.243.144",
          - "52.154.243.170",
          - "52.154.243.184",
          - "52.154.243.213",
          - "52.154.244.23",
          - "52.154.244.169",
          - "52.154.244.221",
          - "52.154.244.240",
          - "52.154.245.2",
          - "52.154.245.48",
          - "52.154.245.103",
          - "52.154.245.121",
          - "13.89.118.252",
          - "52.154.158.226",
          - "52.154.159.109",
          - "52.154.159.179",
          - "52.154.159.187",
          - "52.154.159.238",
          - "20.40.202.3",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses    = "52.154.243.144,52.154.243.170,52.154.243.184,52.154.243.213,52.154.244.23,52.154.244.169,52.154.244.221,52.154.244.240,52.154.245.2,52.154.245.48,52.154.245.103,52.154.245.121,13.89.118.252,52.154.158.226,52.154.159.109,52.154.159.179,52.154.159.187,52.154.159.238,20.40.202.3" -> (known after apply)
      ~ site_credential                   = [
          - {
              - password = "0gWfbeXABvrASucoPcBMtwTqtpftveanslZhwq3BYoeFwqRgmqtywkPjekk1"
              - username = "$gratibot-non-prod-service"
            },
        ] -> (known after apply)
      - tags                              = {} -> null
        # (6 unchanged attributes hidden)

      ~ auth_settings {
          ~ additional_login_params        = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      ~ logs {
          ~ detailed_error_messages_enabled = false -> (known after apply)
          ~ failed_request_tracing_enabled  = false -> (known after apply)

          ~ application_logs {
              ~ file_system_level = "Off" -> (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          ~ http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              ~ file_system {
                  ~ retention_in_days = 2 -> (known after apply)
                  ~ retention_in_mb   = 35 -> (known after apply)
                }
            }
        }

      ~ site_config {
          - default_documents           = [] -> null
          ~ ftps_state                  = "AllAllowed" -> (known after apply)
          ~ ip_restriction              = [] -> (known after apply)
          ~ linux_fx_version            = "DOCKER|docker.io/grantesparza/gratibot:v0.1.1" -> "DOCKER|docker.io/grantesparza/gratibot:v0.1.0"
          ~ local_mysql_enabled         = false -> (known after apply)
          ~ managed_pipeline_mode       = "Integrated" -> (known after apply)
          ~ min_tls_version             = "1.2" -> (known after apply)
          ~ number_of_workers           = 1 -> (known after apply)
          ~ remote_debugging_version    = "VS2019" -> (known after apply)
          ~ scm_ip_restriction          = [] -> (known after apply)
          ~ scm_type                    = "None" -> (known after apply)
          - use_32_bit_worker_process   = false -> null
          ~ websockets_enabled          = false -> (known after apply)
          + windows_fx_version          = (known after apply)
            # (5 unchanged attributes hidden)

          ~ cors {
              ~ allowed_origins     = [] -> (known after apply)
              ~ support_credentials = false -> (known after apply)
            }
        }

      ~ source_control {
          ~ branch             = "master" -> (known after apply)
          ~ manual_integration = false -> (known after apply)
          + repo_url           = (known after apply)
          ~ rollback_enabled   = false -> (known after apply)
          ~ use_mercurial      = false -> (known after apply)
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_app_service_plan.gratibot_app_service_plan must be replaced
-/+ resource "azurerm_app_service_plan" "gratibot_app_service_plan" {
      ~ id                           = "/subscriptions/761bf739-12c3-43cb-bec9-d87c1d7fa459/resourceGroups/gratibot-azure-data/providers/Microsoft.Web/serverfarms/gratibot-non-prod-service-plan" -> (known after apply)
      - is_xenon                     = false -> null
      ~ kind                         = "linux" -> "Linux"
      ~ maximum_elastic_worker_count = 3 -> (known after apply)
      ~ maximum_number_of_workers    = 30 -> (known after apply)
      ~ name                         = "gratibot-non-prod-service-plan" -> "gratibot-nonprod-service-plan"
      - per_site_scaling             = false -> null
      - tags                         = {} -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>